title: Potentially malicious URL click was detected
id: ed5a70ef-a928-43dc-9f5d-4da88d10e0d3
status: experimental
description: Alert when A potentially malicious URL click was detected in O365
author: Josh Nickels
date: 2022/9/26
references:
    - https://learn.microsoft.com/en-us/microsoft-365/compliance/alert-policies?view=o365-worldwide
logsource:
    service: threat_management
    product: m365
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: 'A potentially malicious URL click was detected'
        status: Succeeded
    condition: selection
falsepositives:
    - Non-malicious URL or False Positive URL detection by Microsoft
level: high
tags:
    - attack.initial_access
    - attack.T1566.002
