title: Process Hollowing of BitlockerTogo.exe
id: 7f2376f9-42ee-4dfc-9360-fecff9a88fc8
status: experimental
description: Lumma stealer has been seen hollowing the process of bitlockertogo.exe.
    Normally this app will never make network connections, so the presence of one is suspicious
    and worth investigating
references:
    - https://tria.ge/240521-ynezpagf56/behavioral1
    - https://any.run/report/6eea2773c1b4b5c6fb7c142933e220c96f9a4ec89055bf0cf54accdcde7df535/a407f006-ee45-420d-b576-f259094df091
author: Josh Nickels, mttaggart
date: 2024/06/28
logsource:
    category: network_connection
    product: windows
detection:
    selection_image:
        Image: 'bitlockertogo.exe'
    selection_init:
        Initiated: 'true'
    condition: all of 1 of selection_*
falsepositives:
    - Unknown
level: low
tags:
    - attack.defense_evasion
    - attack.t1218
