title: Local User Account Added
id: f4f1cced-71a6-481a-924f-7ca91193b11a
description: Local user added via command line
status: experimental
date: 2023/02/21
author: Josh Nickels
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.localaccounts/new-localuser?view=powershell-5.1
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771865(v=ws.11)
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|startswith:
            - net user
            - new-localuser
    condition: selection
falsepositives:
    - legitimate reasons for adding local user account
level: medium
tags:
    - attack.persistence
    - attack.t1136.001